In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [2]:
con = sqlite3.connect('sqlite_db_pythonsqlite.db')

In [3]:
cur = con.cursor()

In [4]:
cur.execute('SELECT * FROM Facilities')

In [5]:
results = cur.fetchall()
print(results)

[(0, 'Tennis Court 1', 5, 25, 10000, 200), (1, 'Tennis Court 2', 5, 25, 8000, 200), (2, 'Badminton Court', 0, 15.5, 4000, 50), (3, 'Table Tennis', 0, 5, 320, 10), (4, 'Massage Room 1', 9.9, 80, 4000, 3000), (5, 'Massage Room 2', 9.9, 80, 4000, 3000), (6, 'Squash Court', 3.5, 17.5, 5000, 80), (7, 'Snooker Table', 0, 5, 450, 15), (8, 'Pool Table', 0, 5, 400, 15)]

In [6]:
cur.close()

In [7]:
df_fac = pd.read_sql_query('SELECT * FROM Facilities', con)

In [8]:
df_bk = pd.read_sql_query('SELECT * FROM Bookings', con)
df_mem = pd.read_sql_query('SELECT * FROM Members', con)

In [9]:
print (df_fac.head())

   facid             name  membercost  guestcost  initialoutlay  \
0      0   Tennis Court 1         5.0       25.0          10000
1      1   Tennis Court 2         5.0       25.0           8000
2      2  Badminton Court         0.0       15.5           4000
3      3     Table Tennis         0.0        5.0            320
4      4   Massage Room 1         9.9       80.0           4000

   monthlymaintenance
0                 200
1                 200
2                  50
3                  10
4                3000

In [10]:
print(df_bk.head())

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [11]:
print(df_mem.head())

   memid   surname firstname                       address  zipcode  \
0      0     GUEST     GUEST                         GUEST        0
1      1     Smith    Darren    8 Bloomsbury Close, Boston     4321
2      2     Smith     Tracy  8 Bloomsbury Close, New York     4321
3      3    Rownam       Tim        23 Highway Way, Boston    23423
4      4  Joplette    Janice    20 Crossing Road, New York      234

        telephone recommendedby             joindate
0  (000) 000-0000                2012-07-01 00:00:00
1    555-555-5555                2012-07-02 12:02:05
2    555-555-5555                2012-07-02 12:08:23
3  (844) 693-0723                2012-07-03 09:32:15
4  (833) 942-4710             1  2012-07-03 10:25:05

### Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [12]:
df_10 = df_bk.merge(df_fac, on='facid')

In [13]:
print(df_10)

      bookid  facid  memid            starttime  slots            name  \
0          0      3      1  2012-07-03 11:00:00      2    Table Tennis
1         19      3      3  2012-07-05 09:00:00      2    Table Tennis
2         20      3      1  2012-07-05 19:00:00      2    Table Tennis
3         30      3      1  2012-07-06 11:00:00      2    Table Tennis
4         43      3      2  2012-07-07 12:30:00      2    Table Tennis
...      ...    ...    ...                  ...    ...             ...
4038    3868      5     11  2012-09-28 16:00:00      2  Massage Room 2
4039    3869      5      0  2012-09-28 17:00:00      4  Massage Room 2
4040    3937      5      0  2012-09-29 12:30:00      2  Massage Room 2
4041    4009      5      0  2012-09-30 11:30:00      2  Massage Room 2
4042    4010      5      0  2012-09-30 19:30:00      2  Massage Room 2

      membercost  guestcost  initialoutlay  monthlymaintenance
0            0.0        5.0            320                  10
1            0.0        5.0            320                  10
2            0.0        5.0            320                  10
3            0.0        5.0            320                  10
4            0.0        5.0            320                  10
...          ...        ...            ...                 ...
4038         9.9       80.0           4000                3000
4039         9.9       80.0           4000                3000
4040         9.9       80.0           4000                3000
4041         9.9       80.0           4000                3000
4042         9.9       80.0           4000                3000

[4043 rows x 10 columns]

In [14]:
df_10.loc[df_10['memid']==0, 'cost'] = df_10['slots']*df_10['guestcost']
df_10.loc[df_10['memid']!=0, 'cost'] = df_10['slots']*df_10['membercost']
print(df_10)

      bookid  facid  memid            starttime  slots            name  \
0          0      3      1  2012-07-03 11:00:00      2    Table Tennis
1         19      3      3  2012-07-05 09:00:00      2    Table Tennis
2         20      3      1  2012-07-05 19:00:00      2    Table Tennis
3         30      3      1  2012-07-06 11:00:00      2    Table Tennis
4         43      3      2  2012-07-07 12:30:00      2    Table Tennis
...      ...    ...    ...                  ...    ...             ...
4038    3868      5     11  2012-09-28 16:00:00      2  Massage Room 2
4039    3869      5      0  2012-09-28 17:00:00      4  Massage Room 2
4040    3937      5      0  2012-09-29 12:30:00      2  Massage Room 2
4041    4009      5      0  2012-09-30 11:30:00      2  Massage Room 2
4042    4010      5      0  2012-09-30 19:30:00      2  Massage Room 2

      membercost  guestcost  initialoutlay  monthlymaintenance   cost
0            0.0        5.0            320                  10    0.0
1            0.0        5.0            320                  10    0.0
2            0.0        5.0            320                  10    0.0
3            0.0        5.0            320                  10    0.0
4            0.0        5.0            320                  10    0.0
...          ...        ...            ...                 ...    ...
4038         9.9       80.0           4000                3000   19.8
4039         9.9       80.0           4000                3000  320.0
4040         9.9       80.0           4000                3000  160.0
4041         9.9       80.0           4000                3000  160.0
4042         9.9       80.0           4000                3000  160.0

[4043 rows x 11 columns]

In [15]:
df_10_result = df_10.groupby('name')['cost'].sum()

In [16]:
print(df_10_result)

name
Badminton Court     1906.5
Massage Room 1     50351.6
Massage Room 2     14454.6
Pool Table           270.0
Snooker Table        240.0
Squash Court       13468.0
Table Tennis         180.0
Tennis Court 1     13860.0
Tennis Court 2     14310.0
Name: cost, dtype: float64

In [17]:
print(df_10_result[df_10_result<1000])

name
Pool Table       270.0
Snooker Table    240.0
Table Tennis     180.0
Name: cost, dtype: float64

### Q11. Produce a report of members and who recommended them in alphabetic surname,firstname order

In [41]:
df_11 = df_mem.drop(columns=['address','zipcode','telephone','joindate'])

In [42]:
print(df_11.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   memid          31 non-null     int64
 1   surname        31 non-null     object
 2   firstname      31 non-null     object
 3   recommendedby  31 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.1+ KB
None

In [ ]:
df_11['recommendedby'] = df_11['recommendedby'].replace('',-1).astype('int')

In [55]:
df_11_result = df_11.merge(df_11, left_on='recommendedby',right_on='memid', how='left', suffixes=('_1','_2'))

In [56]:
print(df_11_result)

    memid_1          surname_1 firstname_1  recommendedby_1  memid_2  \
0         0              GUEST       GUEST               -1      NaN
1         1              Smith      Darren               -1      NaN
2         2              Smith       Tracy               -1      NaN
3         3             Rownam         Tim               -1      NaN
4         4           Joplette      Janice                1      1.0
5         5            Butters      Gerald                1      1.0
6         6              Tracy      Burton               -1      NaN
7         7               Dare       Nancy                4      4.0
8         8             Boothe         Tim                3      3.0
9         9           Stibbons      Ponder                6      6.0
10       10               Owen     Charles                1      1.0
11       11              Jones       David                4      4.0
12       12              Baker        Anne                9      9.0
13       13            Farrell      Jemima               -1      NaN
14       14              Smith        Jack                1      1.0
15       15              Bader    Florence                9      9.0
16       16              Baker     Timothy               13     13.0
17       17             Pinker       David               13     13.0
18       20            Genting     Matthew                5      5.0
19       21          Mackenzie        Anna                1      1.0
20       22             Coplin        Joan               16     16.0
21       24             Sarwin   Ramnaresh               15     15.0
22       26              Jones     Douglas               11     11.0
23       27             Rumney   Henrietta               20     20.0
24       28            Farrell       David               -1      NaN
25       29  Worthington-Smyth       Henry                2      2.0
26       30            Purview   Millicent                2      2.0
27       33         Tupperware    Hyacinth               -1      NaN
28       35               Hunt        John               30     30.0
29       36            Crumpet       Erica                2      2.0
30       37              Smith      Darren               -1      NaN

   surname_2 firstname_2  recommendedby_2
0        NaN         NaN              NaN
1        NaN         NaN              NaN
2        NaN         NaN              NaN
3        NaN         NaN              NaN
4      Smith      Darren             -1.0
5      Smith      Darren             -1.0
6        NaN         NaN              NaN
7   Joplette      Janice              1.0
8     Rownam         Tim             -1.0
9      Tracy      Burton             -1.0
10     Smith      Darren             -1.0
11  Joplette      Janice              1.0
12  Stibbons      Ponder              6.0
13       NaN         NaN              NaN
14     Smith      Darren             -1.0
15  Stibbons      Ponder              6.0
16   Farrell      Jemima             -1.0
17   Farrell      Jemima             -1.0
18   Butters      Gerald              1.0
19     Smith      Darren             -1.0
20     Baker     Timothy             13.0
21     Bader    Florence              9.0
22     Jones       David              4.0
23   Genting     Matthew              5.0
24       NaN         NaN              NaN
25     Smith       Tracy             -1.0
26     Smith       Tracy             -1.0
27       NaN         NaN              NaN
28   Purview   Millicent              2.0
29     Smith       Tracy             -1.0
30       NaN         NaN              NaN

In [57]:
df_11_result['recommended'] = df_11_result['surname_2'] + ' ' + df_11_result['firstname_2']

In [59]:
df_11_result['member'] = df_11_result['surname_1'] + ' ' + df_11_result['firstname_1']

In [61]:
df_11_result.drop(columns = ['memid_1','memid_2','recommendedby_1','recommendedby_2','surname_2','firstname_2'], inplace = True)

In [62]:
df_11_result.sort_values(by = ['surname_1','firstname_1'])

            surname_1 firstname_1        recommended                   member
15              Bader    Florence    Stibbons Ponder           Bader Florence
12              Baker        Anne    Stibbons Ponder               Baker Anne
16              Baker     Timothy     Farrell Jemima            Baker Timothy
8              Boothe         Tim         Rownam Tim               Boothe Tim
5             Butters      Gerald       Smith Darren           Butters Gerald
20             Coplin        Joan      Baker Timothy              Coplin Joan
29            Crumpet       Erica        Smith Tracy            Crumpet Erica
7                Dare       Nancy    Joplette Janice               Dare Nancy
24            Farrell       David                NaN            Farrell David
13            Farrell      Jemima                NaN           Farrell Jemima
0               GUEST       GUEST                NaN              GUEST GUEST
18            Genting     Matthew     Butters Gerald          Genting Matthew
28               Hunt        John  Purview Millicent                Hunt John
11              Jones       David    Joplette Janice              Jones David
22              Jones     Douglas        Jones David            Jones Douglas
4            Joplette      Janice       Smith Darren          Joplette Janice
19          Mackenzie        Anna       Smith Darren           Mackenzie Anna
10               Owen     Charles       Smith Darren             Owen Charles
17             Pinker       David     Farrell Jemima             Pinker David
26            Purview   Millicent        Smith Tracy        Purview Millicent
3              Rownam         Tim                NaN               Rownam Tim
23             Rumney   Henrietta    Genting Matthew         Rumney Henrietta
21             Sarwin   Ramnaresh     Bader Florence         Sarwin Ramnaresh
1               Smith      Darren                NaN             Smith Darren
30              Smith      Darren                NaN             Smith Darren
14              Smith        Jack       Smith Darren               Smith Jack
2               Smith       Tracy                NaN              Smith Tracy
9            Stibbons      Ponder       Tracy Burton          Stibbons Ponder
6               Tracy      Burton                NaN             Tracy Burton
27         Tupperware    Hyacinth                NaN      Tupperware Hyacinth
25  Worthington-Smyth       Henry        Smith Tracy  Worthington-Smyth Henry

### Q12 Find the facilities with their usage by member, but not guests

In [67]:
df_mem_bk = df_bk[df_bk['memid']!=0]

In [70]:
df_12 = df_mem_bk.groupby('facid').agg({'slots':sum})

In [72]:
df_12_result = df_12.merge(df_fac, how='left',on='facid')

In [73]:
print(df_12_result)

   facid  slots             name  membercost  guestcost  initialoutlay  \
0      0    957   Tennis Court 1         5.0       25.0          10000
1      1    882   Tennis Court 2         5.0       25.0           8000
2      2   1086  Badminton Court         0.0       15.5           4000
3      3    794     Table Tennis         0.0        5.0            320
4      4    884   Massage Room 1         9.9       80.0           4000
5      5     54   Massage Room 2         9.9       80.0           4000
6      6    418     Squash Court         3.5       17.5           5000
7      7    860    Snooker Table         0.0        5.0            450
8      8    856       Pool Table         0.0        5.0            400

   monthlymaintenance
0                 200
1                 200
2                  50
3                  10
4                3000
5                3000
6                  80
7                  15
8                  15

In [75]:
df_12_result.drop(columns =['membercost','guestcost','initialoutlay','monthlymaintenance'],inplace = True)

In [76]:
df_12_result['usage(hr)'] = df_12_result['slots']/2

In [77]:
print(df_12_result)

   facid  slots             name  usage(hr)
0      0    957   Tennis Court 1      478.5
1      1    882   Tennis Court 2      441.0
2      2   1086  Badminton Court      543.0
3      3    794     Table Tennis      397.0
4      4    884   Massage Room 1      442.0
5      5     54   Massage Room 2       27.0
6      6    418     Squash Court      209.0
7      7    860    Snooker Table      430.0
8      8    856       Pool Table      428.0

### Q13 Find the facilities usage by month, but not guests

In [78]:
print(df_mem_bk)

      bookid  facid  memid            starttime  slots
0          0      3      1  2012-07-03 11:00:00      2
1          1      4      1  2012-07-03 08:00:00      2
3          3      7      1  2012-07-03 19:00:00      2
4          4      8      1  2012-07-03 10:00:00      1
5          5      8      1  2012-07-03 15:00:00      1
...      ...    ...    ...                  ...    ...
4038    4038      8     29  2012-09-30 16:30:00      2
4039    4039      8     29  2012-09-30 18:00:00      1
4040    4040      8     21  2012-09-30 18:30:00      1
4041    4041      8     16  2012-09-30 19:00:00      1
4042    4042      8     29  2012-09-30 19:30:00      1

[3160 rows x 5 columns]

In [79]:
import datetime as dt

In [83]:
df_mem_bk['starttime'] = pd.to_datetime(df_mem_bk['starttime'])

<ipython-input-83-654ae4f0be09>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_mem_bk['starttime'] = pd.to_datetime(df_mem_bk['starttime'])

In [84]:
df_mem_bk.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3160 entries, 0 to 4042
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   bookid     3160 non-null   int64
 1   facid      3160 non-null   int64
 2   memid      3160 non-null   int64
 3   starttime  3160 non-null   datetime64[ns]
 4   slots      3160 non-null   int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 148.1 KB

In [85]:
df_mem_bk['month'] = df_mem_bk['starttime'].dt.month

<ipython-input-85-bbc44a712c7e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_mem_bk['month'] = df_mem_bk['starttime'].dt.month

In [86]:
print(df_mem_bk)

      bookid  facid  memid           starttime  slots  month
0          0      3      1 2012-07-03 11:00:00      2      7
1          1      4      1 2012-07-03 08:00:00      2      7
3          3      7      1 2012-07-03 19:00:00      2      7
4          4      8      1 2012-07-03 10:00:00      1      7
5          5      8      1 2012-07-03 15:00:00      1      7
...      ...    ...    ...                 ...    ...    ...
4038    4038      8     29 2012-09-30 16:30:00      2      9
4039    4039      8     29 2012-09-30 18:00:00      1      9
4040    4040      8     21 2012-09-30 18:30:00      1      9
4041    4041      8     16 2012-09-30 19:00:00      1      9
4042    4042      8     29 2012-09-30 19:30:00      1      9

[3160 rows x 6 columns]

In [91]:
df_13 = df_mem_bk.groupby(['month','facid']).agg({'slots':sum})

In [109]:
df_13_result = df_13.reset_index().merge(df_fac, how='left', on='facid').set_index(['month','facid'])

In [110]:
df_13_result.drop(columns = ['membercost','guestcost','initialoutlay','monthlymaintenance'],inplace = True)

In [112]:
df_13_result['usage(hr)'] = df_13_result['slots']/2

In [113]:
print(df_13_result)

             slots             name  usage(hr)
month facid
7     0        201   Tennis Court 1      100.5
      1        123   Tennis Court 2       61.5
      2        165  Badminton Court       82.5
      3         98     Table Tennis       49.0
      4        166   Massage Room 1       83.0
      5          8   Massage Room 2        4.0
      6         50     Squash Court       25.0
      7        140    Snooker Table       70.0
      8        110       Pool Table       55.0
8     0        339   Tennis Court 1      169.5
      1        345   Tennis Court 2      172.5
      2        414  Badminton Court      207.0
      3        296     Table Tennis      148.0
      4        316   Massage Room 1      158.0
      5         18   Massage Room 2        9.0
      6        184     Squash Court       92.0
      7        316    Snooker Table      158.0
      8        303       Pool Table      151.5
9     0        417   Tennis Court 1      208.5
      1        414   Tennis Court 2      207.0
      2        507  Badminton Court      253.5
      3        400     Table Tennis      200.0
      4        402   Massage Room 1      201.0
      5         28   Massage Room 2       14.0
      6        184     Squash Court       92.0
      7        404    Snooker Table      202.0
      8        443       Pool Table      221.5